src/main/resources/xml/experienceMediaServiceV1/encodeOverriddenMedias/encodeOverriddenMedias.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.experiencemediav1.fulfillment.lodging.bussvcs.wdpr.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:encodeOverriddenMedias>
         <travelPlanId>?</travelPlanId>
         <!--Zero or more repetitions:-->
         <experienceMedia mediaType="?" chipType="?">
            <!--1 or more repetitions:-->
            <rfidMediaReferences type="?" value="?"/>
         </experienceMedia>
         <!--Optional:-->
         <locationId>?</locationId>
         <context>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </context>
      </ser:encodeOverriddenMedias>
   </soapenv:Body>
</soapenv:Envelope>
